#include <stdio.h>
#include <stdlib.h>

void main(){
    int DAT_00408970 = 0x63008A5A;
    int DAT_0040897c = 0x63CD1DAF;
    int DAT_00408978 = 0x63CDEFD5;
    int DAT_00408974 = 0x31E69873;
    int DAT_00408980 = 0x63CDFC4D; // не используется
    int DAT_00408030 = 0x63CDEE4B;
	int DAT_00408034 = 0x63CC0DA1; // не используется
    unsigned char data[] = {136, 212, 55, 214, 132, 178, 27, 51, 174, 40, 137, 144, 25, 37, 177, 45, 107, 16, 102, 212, 47, 114, 51, 179, 123, 191, 220, 21, 62, 114, 123, 103, 91, 67, 195, 102, 120, 58, 156, 158, 248, 177, 39, 132, 139, 20, 196, 154, 208, 244, 153, 66, 185, 218, 196, 146, 120, 169, 168, 55, 145, 40, 1, 210, 176, 44, 168, 100, 46, 165, 251, 165, 32, 102, 76, 44, 31, 187, 126, 254, 111, 92, 211, 240, 4, 98, 42, 188, 244, 76, 113, 142, 59, 56, 222, 51, 95, 79, 107, 85};
    
    // stage2
    srand(DAT_00408030); // указание сида рандома
    int r1, r2, r3; // для хранения значений рандома
    for(int i = 0; i < 100; i++){
        r1 = rand();
        r2 = rand();
        r3 = (r1 + (r1 / 0xff)) ^ 0xa3;
        data[i] -= r3 - (r2 + (r2 / 0xff));
    }

    // stage1
    int r;
    for(int i = 0; i < 100; i++){
        srand(DAT_00408974);
        r = rand();
        data[i] -= r + (r / 100) * -100;

        srand(DAT_00408978);
        r = rand();
        data[i] += r + (r / 0xe) * -0xe;

        data[i] -= DAT_0040897c ^ 0x15;

        srand(DAT_00408970);
        r = rand();
        data[i] ^= r + (r / 0xff);
    }

    // print res
    printf("flag: ");
    for(int i = 0; i < 100; i++)
        printf("%c", data[i]);
    printf("\n");
}
